app/controllers/songs_controller.rb

INSERT INTO "songs" ("artist", "title", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "Lola Marsh"], ["title", "Rainbow Girl"], ["time", "4:10"], ["created_at", "2021-02-26 03:40:37.242555"], ["updated_at", "2021-02-26 03:40:37.242555"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "time" = $1, "created_at" = $2, "updated_at" = $3 WHERE "songs"."id" = $4  [["time", "2:80"], ["created_at", "2021-02-26 03:25:22.910000"], ["updated_at", "2021-02-26 03:38:05.256000"], ["id", 1]]
---
  def update
    if @song.update(song_params)